notes/org/dns.org
#+TITLE: DNS
#+SETUPFILE: ../setup.org
#+PROPERTY: header-args+ :var DnsName=DnsName

* Variables                                                        :noexport:

  #+NAME: DnsName
  : lenaclarklegal.com

* Get IP Address(es) for DNS Name

  Get the IP address for a name. This won't work for a name that, say, only has
  NS records associated with it, since that doesn't actually map a name to an
  IP.

  #+begin_src sh :results output
    host $DnsName
  #+end_src

* View Records

** NS

   dig:

   #+begin_src sh :results output
     dig ns $DnsName +short
   #+end_src

   host:

   #+begin_src sh :results output
     host -t ns $DnsName
   #+end_src

** TXT

   #+begin_src sh :results output
     dig -t txt '\@.lenaclarklegal.com' +short
   #+end_src

   #+begin_src sh
     host -t txt '@.lenaclarklegal.com'
   #+end_src

** CNAME

  #+begin_src sh
    dig $DnsName CNAME
  #+end_src

* NS Delegation in AWS

  See notes in =Projects/codenotes/aws/route53_dns_delegation.org=.
