docs/notes/dns.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>DNS</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">DNS</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgaa27ebb">Get IP Address(es) for DNS Name</a></li>
<li><a href="#orgc2d2119">View Records</a>
<ul>
<li><a href="#org1b42fdd">NS</a></li>
<li><a href="#orge7ad3d9">TXT</a></li>
<li><a href="#org50b5d45">CNAME</a></li>
</ul>
</li>
<li><a href="#org10c5427">NS Delegation in AWS</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgaa27ebb" class="outline-2">
<h2 id="orgaa27ebb"><a href="#orgaa27ebb">Get IP Address(es) for DNS Name</a></h2>
<div class="outline-text-2" id="text-orgaa27ebb">
<p>
Get the IP address for a name. This won't work for a name that, say, only has
NS records associated with it, since that doesn't actually map a name to an
IP.
</p>

<div class="org-src-container">
<pre class="src src-sh">host $<span style="color: #dcaeea;">DnsName</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc2d2119" class="outline-2">
<h2 id="orgc2d2119"><a href="#orgc2d2119">View Records</a></h2>
<div class="outline-text-2" id="text-orgc2d2119">
</div>
<div id="outline-container-org1b42fdd" class="outline-3">
<h3 id="org1b42fdd"><a href="#org1b42fdd">NS</a></h3>
<div class="outline-text-3" id="text-org1b42fdd">
<p>
dig:
</p>

<div class="org-src-container">
<pre class="src src-sh">dig ns $<span style="color: #dcaeea;">DnsName</span> +short
</pre>
</div>

<p>
host:
</p>

<div class="org-src-container">
<pre class="src src-sh">host -t ns $<span style="color: #dcaeea;">DnsName</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge7ad3d9" class="outline-3">
<h3 id="orge7ad3d9"><a href="#orge7ad3d9">TXT</a></h3>
<div class="outline-text-3" id="text-orge7ad3d9">
<div class="org-src-container">
<pre class="src src-sh">dig -t txt <span style="color: #98be65;">'\@.lenaclarklegal.com'</span> +short
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">host -t txt <span style="color: #98be65;">'@.lenaclarklegal.com'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org50b5d45" class="outline-3">
<h3 id="org50b5d45"><a href="#org50b5d45">CNAME</a></h3>
<div class="outline-text-3" id="text-org50b5d45">
<div class="org-src-container">
<pre class="src src-sh">dig $<span style="color: #dcaeea;">DnsName</span> CNAME +short
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org10c5427" class="outline-2">
<h2 id="org10c5427"><a href="#org10c5427">NS Delegation in AWS</a></h2>
<div class="outline-text-2" id="text-org10c5427">
<p>
See notes in <code>Projects/codenotes/aws/route53_dns_delegation.org</code>.
</p>
</div>
</div>
</div>
</body>
</html>
